Repository: eliasNr-11/cbe-noor-clone
Catalog: lib/l10n/app_*.arb
Languages: am

source: Welcome!
am: እንኳን ደህና መጡ!

source: CBE NOOR
am: ሲቢኢ ኑር

source: PIN
am: ፒን

# copyright
source: Copyright Â© Commercial Bank of Ethiopia
am: ኮፒ ራይት © የኢትዮጵያ ንግድ ባንክ

source: Home
am: ዋና

source: Accounts
am: ሂሳቦች

source: Recents
am: የቅርብ

source: Balance
am: ቀሪ ሒሳብ

source: Birr
am: ብር

source: Services
am: አገልግሎቶች

source: Transfer
am: ገንዘብ መላክ

# peopel
source: People
am: ተጠቃሚዎች

source: Utilities
am: ክፍያዎች

source: Top Up
am: የአየር ሰአት

source: Change Pin
am: ፒን ቀይር

source: Unsubscribe
am: ከ ደንበኝነት ምዝገባ ይውጡ

source: Logout
am: ውጣ

source: About
am: ስለ እኛ

source: Rate This App
am: ሬት አፕ

source: Withdrawal
am: ወጭ

source: Deposit
am: ገቢ

source: Recent Transactions
am: የቅርብ ገቢ እና ወጭዎች
